{"cells":[{"cell_type":"code","source":["!pip install neo4j"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"VMaVZ_5FAZlV","executionInfo":{"status":"ok","timestamp":1740970786176,"user_tz":-540,"elapsed":11731,"user":{"displayName":"김재웅","userId":"06729560528582252852"}},"outputId":"142552b7-5326-4cc2-d3c7-dc2c8e582a32"},"id":"VMaVZ_5FAZlV","execution_count":1,"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting neo4j\n","  Downloading neo4j-5.28.1-py3-none-any.whl.metadata (5.9 kB)\n","Requirement already satisfied: pytz in /usr/local/lib/python3.11/dist-packages (from neo4j) (2025.1)\n","Downloading neo4j-5.28.1-py3-none-any.whl (312 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m312.3/312.3 kB\u001b[0m \u001b[31m3.4 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hInstalling collected packages: neo4j\n","Successfully installed neo4j-5.28.1\n"]}]},{"cell_type":"code","source":["from google.colab import drive\n","import os\n","\n","# 먼저 구글 드라이브 마운트\n","drive.mount('/content/drive')\n","\n","# 디렉토리 변경\n","os.chdir('/content/drive/MyDrive/working_directory')\n","\n","GRAPHRAG_FOLDER = '/content/drive/MyDrive/working_directory/output'"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"t0San4J7DsIP","executionInfo":{"status":"ok","timestamp":1740970892836,"user_tz":-540,"elapsed":52906,"user":{"displayName":"김재웅","userId":"06729560528582252852"}},"outputId":"7b7fa198-4740-494f-f058-dc24b8b2d95d"},"id":"t0San4J7DsIP","execution_count":2,"outputs":[{"output_type":"stream","name":"stdout","text":["Mounted at /content/drive\n"]}]},{"cell_type":"code","source":["from neo4j import GraphDatabase\n","import pandas as pd\n","import time\n","\n","#실제 인스턴스 정보를 입력합니다.\n","NEO4J_URI=\"neo4j+s://0947fe48.databases.neo4j.io\"\n","NEO4J_USERNAME=\"neo4j\"\n","NEO4J_PASSWORD=\"e74rST4ncmK9KyhDzpZueb3u43btmjl9Dhzl954552c\"\n","NEO4J_DATABASE = \"neo4j\"\n","\n","driver = GraphDatabase.driver(NEO4J_URI, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))"],"metadata":{"id":"lq4K_-PPAYyy","executionInfo":{"status":"ok","timestamp":1740972124834,"user_tz":-540,"elapsed":196,"user":{"displayName":"김재웅","userId":"06729560528582252852"}}},"id":"lq4K_-PPAYyy","execution_count":38,"outputs":[]},{"cell_type":"code","source":["def batched_import(statement, df, batch_size=1000):\n","    \"\"\"\n","    Import a dataframe into Neo4j using a batched approach.\n","\n","    Parameters: statement is the Cypher query to execute, df is the dataframe to import, and batch_size is the number of rows to import in each batch.\n","    \"\"\"\n","    total = len(df)\n","    start_s = time.time()\n","    for start in range(0, total, batch_size):\n","        batch = df.iloc[start : min(start + batch_size, total)]\n","        result = driver.execute_query(\n","            \"UNWIND $rows AS value \" + statement,\n","            rows=batch.to_dict(\"records\"),\n","            database_=NEO4J_DATABASE,\n","        )\n","        print(result.summary.counters)\n","    print(f\"{total} rows in {time.time() - start_s} s.\")\n","    return total"],"metadata":{"id":"TytOu9e0E-zx","executionInfo":{"status":"ok","timestamp":1740972126119,"user_tz":-540,"elapsed":14,"user":{"displayName":"김재웅","userId":"06729560528582252852"}}},"id":"TytOu9e0E-zx","execution_count":39,"outputs":[]},{"cell_type":"code","execution_count":40,"id":"d787bf7b-ac9b-4bfb-b140-a50a3fd205c5","metadata":{"id":"d787bf7b-ac9b-4bfb-b140-a50a3fd205c5","executionInfo":{"status":"ok","timestamp":1740972130592,"user_tz":-540,"elapsed":1176,"user":{"displayName":"김재웅","userId":"06729560528582252852"}},"colab":{"base_uri":"https://localhost:8080/"},"outputId":"bf97a502-5bad-42a2-92db-82d6443b9dc0"},"outputs":[{"output_type":"stream","name":"stdout","text":["\n","create constraint chunk_id if not exists for (c:__Chunk__) require c.id is unique\n","\n","create constraint document_id if not exists for (d:__Document__) require d.id is unique\n","\n","create constraint entity_id if not exists for (c:__Community__) require c.community is unique\n","\n","create constraint entity_id if not exists for (e:__Entity__) require e.id is unique\n","\n","create constraint entity_title if not exists for (e:__Entity__) require e.name is unique\n","\n","create constraint entity_title if not exists for (e:__Covariate__) require e.title is unique\n","\n","create constraint related_id if not exists for ()-[rel:RELATED]->() require rel.id is unique\n"]}],"source":["# create constraints, idempotent operation\n","\n","statements = [\n","    \"\\ncreate constraint chunk_id if not exists for (c:__Chunk__) require c.id is unique\",\n","    \"\\ncreate constraint document_id if not exists for (d:__Document__) require d.id is unique\",\n","    \"\\ncreate constraint entity_id if not exists for (c:__Community__) require c.community is unique\",\n","    \"\\ncreate constraint entity_id if not exists for (e:__Entity__) require e.id is unique\",\n","    \"\\ncreate constraint entity_title if not exists for (e:__Entity__) require e.name is unique\",\n","    \"\\ncreate constraint entity_title if not exists for (e:__Covariate__) require e.title is unique\",\n","    \"\\ncreate constraint related_id if not exists for ()-[rel:RELATED]->() require rel.id is unique\",\n","    \"\\n\",\n","]\n","\n","for statement in statements:\n","    if len((statement or \"\").strip()) > 0:\n","        print(statement)\n","        driver.execute_query(statement)"]},{"cell_type":"code","execution_count":37,"id":"ed7f212e-9148-424c-adc6-d81db9f8e5a5","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ed7f212e-9148-424c-adc6-d81db9f8e5a5","executionInfo":{"status":"ok","timestamp":1740922277406,"user_tz":-540,"elapsed":748,"user":{"displayName":"김재웅","userId":"06729560528582252852"}},"outputId":"00120890-23fb-4c47-a3d8-353bb413d58b"},"outputs":[{"output_type":"stream","name":"stdout","text":["{'_contains_updates': True, 'labels_added': 1, 'nodes_created': 1, 'properties_set': 2}\n","1 rows in 0.6232659816741943 s.\n"]},{"output_type":"execute_result","data":{"text/plain":["1"]},"metadata":{},"execution_count":37}],"source":["doc_df = pd.read_parquet(\n","    f\"{GRAPHRAG_FOLDER}/create_final_documents.parquet\", columns=[\"id\", \"title\"]\n",")\n","\n","# Import documents\n","statement = \"\"\"\n","MERGE (d:__Document__ {id:value.id})\n","SET d += value {.title}\n","\"\"\"\n","\n","batched_import(statement, doc_df)"]},{"cell_type":"code","source":["# 텍스트 유닛(청크) 임포트\n","text_df = pd.read_parquet(f'{GRAPHRAG_FOLDER}/create_final_text_units.parquet', columns=[\"id\", \"text\", \"n_tokens\", \"document_ids\"])\n","\n","statement = \"\"\"\n","MERGE (c:__Chunk__ {id:value.id})\n","SET c += value {.text, .n_tokens}\n","WITH c, value\n","UNWIND value.document_ids AS document\n","MATCH (d:__Document__ {id:document})\n","MERGE (c)-[:PART_OF]->(d)\n","\"\"\"\n","\n","batched_import(statement, text_df)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"eacxZ2VODese","executionInfo":{"status":"ok","timestamp":1740922280370,"user_tz":-540,"elapsed":1739,"user":{"displayName":"김재웅","userId":"06729560528582252852"}},"outputId":"bdaa8ddb-fab6-45e3-82f9-7813aab0f835"},"id":"eacxZ2VODese","execution_count":38,"outputs":[{"output_type":"stream","name":"stdout","text":["{'_contains_updates': True, 'labels_added': 29, 'relationships_created': 29, 'nodes_created': 29, 'properties_set': 87}\n","29 rows in 1.6789968013763428 s.\n"]},{"output_type":"execute_result","data":{"text/plain":["29"]},"metadata":{},"execution_count":38}]},{"cell_type":"code","source":["# 엔티티 임포트\n","entity_df = pd.read_parquet(\n","    f'{GRAPHRAG_FOLDER}/create_final_entities.parquet',\n","    columns=[\"title\", \"type\", \"description\", \"human_readable_id\", \"id\", \"text_unit_ids\"]\n",")\n","\n","#  Cypher 쿼리\n","statement = \"\"\"\n","MERGE (e:__Entity__ {id: value.id})\n","SET e.human_readable_id = value.human_readable_id,\n","    e.description = value.description,\n","    e.name = coalesce(replace(value.title, '\"', ''), 'Unknown')\n","WITH e, value\n","CALL apoc.create.addLabels(e, CASE WHEN coalesce(value.type, \"\") = \"\" THEN [] ELSE [apoc.text.upperCamelCase(replace(value.type, '\"', ''))] END) YIELD node\n","UNWIND value.text_unit_ids AS text_unit\n","MATCH (c:__Chunk__ {id: text_unit})\n","MERGE (c)-[:HAS_ENTITY]->(e)\n","\"\"\"\n","\n","# 데이터 임포트 실행\n","batched_import(statement, entity_df)\n","\n","print(\"엔티티 임포트가 완료되었습니다.\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"PyQ5XUSRpVaZ","executionInfo":{"status":"ok","timestamp":1740922283584,"user_tz":-540,"elapsed":1599,"user":{"displayName":"김재웅","userId":"06729560528582252852"}},"outputId":"53c6857b-373a-4c48-cc6b-4a8da3a3d1c6"},"id":"PyQ5XUSRpVaZ","execution_count":39,"outputs":[{"output_type":"stream","name":"stdout","text":["{'_contains_updates': True, 'labels_added': 154, 'relationships_created': 190, 'nodes_created': 154, 'properties_set': 616}\n","154 rows in 1.4883091449737549 s.\n","엔티티 임포트가 완료되었습니다.\n"]}]},{"cell_type":"code","source":["# 관계 임포트\n","rel_df = pd.read_parquet(f'{GRAPHRAG_FOLDER}/create_final_relationships.parquet',\n","                         columns=[\"source\", \"target\", \"id\", \"combined_degree\", \"weight\", \"human_readable_id\", \"description\", \"text_unit_ids\"])\n","\n","\n","rel_statement = \"\"\"\n","    MATCH (source:__Entity__ {name:replace(value.source,'\"','')})\n","    MATCH (target:__Entity__ {name:replace(value.target,'\"','')})\n","    MERGE (source)-[rel:RELATED {id: value.id}]->(target)\n","    SET rel += value {.rank, .weight, .human_readable_id, .description, .text_unit_ids}\n","    RETURN count(*) as createdRels\n","\"\"\"\n","\n","batched_import(rel_statement, rel_df)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ow0DLFM8pVJY","executionInfo":{"status":"ok","timestamp":1740922376012,"user_tz":-540,"elapsed":2233,"user":{"displayName":"김재웅","userId":"06729560528582252852"}},"outputId":"4a087d19-dbed-4a90-c045-12468c476025"},"id":"ow0DLFM8pVJY","execution_count":40,"outputs":[{"output_type":"stream","name":"stdout","text":["{'_contains_updates': True, 'relationships_created': 173, 'properties_set': 865}\n","173 rows in 2.290102481842041 s.\n"]},{"output_type":"execute_result","data":{"text/plain":["173"]},"metadata":{},"execution_count":40}]},{"cell_type":"code","source":["# 커뮤니티 임포트\n","community_df = pd.read_parquet(\n","    f'{GRAPHRAG_FOLDER}/create_final_communities.parquet',\n","    columns=[\"id\", \"level\", \"title\", \"text_unit_ids\", \"relationship_ids\"]\n",")\n","\n","statement = \"\"\"\n","MERGE (c:__Community__ {community: value.title})\n","SET c.title = value.title,\n","    c.level = value.level\n","WITH c, value\n","UNWIND value.text_unit_ids as text_unit_id\n","MATCH (t:__Chunk__ {id: text_unit_id})\n","MERGE (c)-[:HAS_CHUNK]->(t)\n","WITH distinct c, value\n","UNWIND value.relationship_ids as rel_id\n","MATCH (start:__Entity__)-[:RELATED {id: rel_id}]->(end:__Entity__)\n","MERGE (start)-[:IN_COMMUNITY]->(c)\n","MERGE (end)-[:IN_COMMUNITY]->(c)\n","RETURN count(distinct c) as createdCommunities\n","\"\"\"\n","\n","batched_import(statement, community_df)\n"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"umKezS5jp-iv","executionInfo":{"status":"ok","timestamp":1740922394145,"user_tz":-540,"elapsed":2133,"user":{"displayName":"김재웅","userId":"06729560528582252852"}},"outputId":"a7ec09bb-2ca5-4036-fec6-f102d570b4b8"},"id":"umKezS5jp-iv","execution_count":41,"outputs":[{"output_type":"stream","name":"stdout","text":["{'_contains_updates': True, 'labels_added': 30, 'relationships_created': 247, 'nodes_created': 30, 'properties_set': 90}\n","30 rows in 2.125743865966797 s.\n"]},{"output_type":"execute_result","data":{"text/plain":["30"]},"metadata":{},"execution_count":41}]},{"cell_type":"code","source":["# 커뮤니티 보고서 임포트\n","community_report_df = pd.read_parquet(\n","    f'{GRAPHRAG_FOLDER}/create_final_community_reports.parquet',\n","    columns=[\"id\", \"community\", \"level\", \"title\", \"summary\", \"findings\", \"rank\", \"rank_explanation\", \"full_content\"]\n",")\n","\n","# community 값을 \"Community \" + 숫자 형태로 문자열을 만들어줌\n","community_report_df['community'] = \"Community \" + community_report_df['community'].astype(str)\n","\n","community_statement = \"\"\"\n","MERGE (c:__Community__ {community: value.community})\n","SET c.level = value.level,\n","    c.name = value.title,\n","    c.rank = value.rank,\n","    c.rank_explanation = value.rank_explanation,\n","    c.full_content = value.full_content,\n","    c.summary = value.summary\n","WITH c, value\n","UNWIND range(0, size(value.findings)-1) AS finding_idx\n","WITH c, value, finding_idx, value.findings[finding_idx] AS finding\n","MERGE (c)-[:HAS_FINDING]->(f:Finding {id: finding_idx})\n","SET f += finding\n","\"\"\"\n","\n","batched_import(community_statement, community_report_df)\n"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"LrOkJUDxqBYB","executionInfo":{"status":"ok","timestamp":1740922455314,"user_tz":-540,"elapsed":1526,"user":{"displayName":"김재웅","userId":"06729560528582252852"}},"outputId":"af5d2109-7467-43ac-ef7a-f5227e0ed9fa"},"id":"LrOkJUDxqBYB","execution_count":43,"outputs":[{"output_type":"stream","name":"stdout","text":["{'_contains_updates': True, 'labels_added': 139, 'relationships_created': 139, 'nodes_created': 139, 'properties_set': 597}\n","30 rows in 1.4974381923675537 s.\n"]},{"output_type":"execute_result","data":{"text/plain":["30"]},"metadata":{},"execution_count":43}]},{"cell_type":"code","source":["# 노드 임포트: 엔티티-커뮤니티 연결\n","node_df = pd.read_parquet(f'{GRAPHRAG_FOLDER}/create_final_nodes.parquet', columns=['id', 'human_readable_id', 'title', 'community', 'level', 'degree', 'x', 'y'])\n","node_df['community'] = \"Community \" + node_df['community'].astype(str)\n","statement = \"\"\"\n","MATCH (e:__Entity__)\n","WHERE e.name = replace(value.title, '\"', '')\n","MERGE (c:__Community__ {community: value.community})\n","MERGE (e)-[:IN_COMMUNITY]->(c)\n","\"\"\"\n","\n","batched_import(statement, node_df)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"sj9YPgZ8BX7w","executionInfo":{"status":"ok","timestamp":1740972824234,"user_tz":-540,"elapsed":485,"user":{"displayName":"김재웅","userId":"06729560528582252852"}},"outputId":"eb0d9fe3-8b84-46a8-b2ac-d191f2741bc0"},"id":"sj9YPgZ8BX7w","execution_count":46,"outputs":[{"output_type":"stream","name":"stdout","text":["{'_contains_updates': True, 'labels_added': 1, 'relationships_created': 59, 'nodes_created': 1, 'properties_set': 1}\n","245 rows in 0.4649958610534668 s.\n"]},{"output_type":"execute_result","data":{"text/plain":["245"]},"metadata":{},"execution_count":46}]}],"metadata":{"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.11.5"},"colab":{"provenance":[]}},"nbformat":4,"nbformat_minor":5}